var
 n, S, u, k : integer;
 { n - кількість дисків
 S - сума за диски
 u - кількість упаковок
 k - }
begin
 read (n);
 S := 0;
 u:= n div 100; //точну кількісті упаковок які точно потрібно купить
 
 S:= S+(U*100);
 n:= n-(U*100);
// знайти для якої кількості дисків дешевше купляти більше дисків 
 if (n>=65) then
  S:= S+100
 else
  begin
  if ((n>=55) and (n<65)) or ((n>=35) and (n<40)) or ((n>=15) and (n<20)) then
    begin
    u:= n div 20;
    S:= S+(u+1)*30;
    end
  else
    begin
    u:= n div 20;
    S:= S+(u*30);
    n:= n-u*20;
    S:=S+n*2;
    //тут купляєм діски поштучно, скільки купить пачок і дісків по одному(6 рядків)    
    end
 end;
 writeln (S);
end.